//  Этот файл содержит функции работы цифрового фильтра угла курса
//--------------------------------------------------------------------
#ifndef __APK25_FILTR_H
#define __APK25_FILTR_H

#ifdef __cplusplus
extern "C" {
#endif

#include "MDR1986VE1T.h"

//--------------------------------------------------------------------

#define SIZE_MASS         64          // Размер массива отсчетов


	
//--------------------------------------------------------------------

	
	
//--------------------------------------------------------------------
void L_PASS_Cheb_64_N(int i);
void L_PASS_Cheb_64_NV(int i);




int16_t Bisector_angle1(int16_t a0,int16_t a1);
void Old_PASS_512(void);


//--------------------------------------------------------------------

#ifdef __cplusplus
} // extern "C" block end
#endif

#endif 

